leetcode_224_basic_calculator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 224. Basic Calculator</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 224. Basic Calculator</h1>
<ul class="org-ul">
<li><a href="mistake_missing_edge_case.html#ID-29B5FD8A-98FD-48CE-8C30-04671E44AD27">Mistake: Missing edge case</a>.  I came up with <code>-(-2)</code> and forgot about <code>(8)</code> which is also a valid expression.</li>
</ul>

<p>
The trick part is how we are going to handle the unary minus operator.  <a href="can_we_simplify_the_problem_which_keeping_it_the_same.html#ID-F19C9539-EE46-41EE-8DEF-24C3076C6DC2">Can we simplify the problem while keeping it the same?</a>  It would make the problem easier if all operator were binary what would require to transform <code>-2</code> in <code>0-2</code>.  There is only two cases were <code>-</code> is an unary operator: (1) it occurs in the beginning of the stack or (2) after an open parentheses.  While parsing, we can insert a <code>0</code> at the right moment and make sure that all operators are binary.  Time and space complexity is \(O(n)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">calculate</span>(<span style="font-weight: bold;">self</span>, s: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">int</span>:
        s = <span style="font-style: italic;">"("</span> + s + <span style="font-style: italic;">")"</span>

        <span style="font-weight: bold; font-style: italic;">st</span> = []
        <span style="font-weight: bold; font-style: italic;">op</span> = []
        <span style="font-weight: bold; font-style: italic;">i</span> = 0
        <span style="font-weight: bold; font-style: italic;">maybe_unary</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>

        <span style="font-weight: bold;">while</span> i &lt; <span style="font-weight: bold;">len</span>(s):
            <span style="font-weight: bold;">if</span> s[i] == <span style="font-style: italic;">"("</span>:
                op.append(<span style="font-style: italic;">"("</span>)
                maybe_unary = <span style="font-weight: bold; text-decoration: underline;">True</span>
                i += 1
            <span style="font-weight: bold;">elif</span> <span style="font-style: italic;">"0"</span> &lt;= s[i] &lt;= <span style="font-style: italic;">"9"</span>:
                j = i
                n = 0
                <span style="font-weight: bold;">while</span> j &lt; <span style="font-weight: bold;">len</span>(s) <span style="font-weight: bold;">and</span> <span style="font-style: italic;">"0"</span> &lt;= s[j] &lt;= <span style="font-style: italic;">"9"</span>:
                    n = n * 10 + <span style="font-weight: bold;">ord</span>(s[j]) - <span style="font-weight: bold;">ord</span>(<span style="font-style: italic;">"0"</span>)
                    j += 1
                st.append(n)
                maybe_unary = <span style="font-weight: bold; text-decoration: underline;">False</span>
                i = j
            <span style="font-weight: bold;">elif</span> s[i] == <span style="font-style: italic;">" "</span>:
                i += 1
            <span style="font-weight: bold;">else</span>:
                <span style="font-weight: bold;">while</span> <span style="font-weight: bold;">len</span>(op) &gt; 0:
                    <span style="font-weight: bold;">if</span> op[-1] == <span style="font-style: italic;">"+"</span>:
                        b = st.pop()
                        a = st.pop()
                        st.append(a + b)
                        op.pop()
                    <span style="font-weight: bold;">elif</span> op[-1] == <span style="font-style: italic;">"-"</span>:
                        b = st.pop()
                        a = st.pop()
                        st.append(a - b)
                        op.pop()
                    <span style="font-weight: bold;">elif</span> op[-1] == <span style="font-style: italic;">"("</span>:
                        <span style="font-weight: bold;">if</span> s[i] == <span style="font-style: italic;">")"</span>:
                            op.pop()
                        <span style="font-weight: bold;">break</span>

                <span style="font-weight: bold;">if</span> s[i] == <span style="font-style: italic;">"-"</span> <span style="font-weight: bold;">and</span> maybe_unary:
                    st.append(0)

                <span style="font-weight: bold;">if</span> s[i] != <span style="font-style: italic;">")"</span>:
                    op.append(s[i])

                maybe_unary = <span style="font-weight: bold; text-decoration: underline;">False</span>
                i += 1

        <span style="font-weight: bold;">return</span> st[0]

<span style="font-weight: bold;">assert</span> Solution().calculate(<span style="font-style: italic;">"1 + 1"</span>) == 2
<span style="font-weight: bold;">assert</span> Solution().calculate(<span style="font-style: italic;">" 2-1 + 2 "</span>) == 3
<span style="font-weight: bold;">assert</span> Solution().calculate(<span style="font-style: italic;">"(1+(4+5+2)-3)+(6+8)"</span>) == 23
<span style="font-weight: bold;">assert</span> Solution().calculate(<span style="font-style: italic;">"-(-2)"</span>) == 2
<span style="font-weight: bold;">assert</span> Solution().calculate(<span style="font-style: italic;">"(2)"</span>) == 2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">calculate</span>(<span style="font-weight: bold;">self</span>, s: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">int</span>:
        s = <span style="font-style: italic;">"("</span> + s + <span style="font-style: italic;">")"</span>
        <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">len</span>(s)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(i, left, right, sign):
            <span style="font-weight: bold;">if</span> i == N:
                <span style="font-weight: bold;">return</span> left + sign * right

            <span style="font-weight: bold;">if</span> s[i] == <span style="font-style: italic;">" "</span>:
                <span style="font-weight: bold;">return</span> dfs(i + 1, left, right, sign)

            <span style="font-weight: bold;">if</span> s[i].isdigit():
                j = i
                <span style="font-weight: bold;">while</span> j &lt; N <span style="font-weight: bold;">and</span> s[j].isdigit():
                    j += 1
                <span style="font-weight: bold;">return</span> dfs(j, left, <span style="font-weight: bold;">int</span>(s[i:j]), sign)

            <span style="font-weight: bold;">if</span> s[i] <span style="font-weight: bold;">in</span> <span style="font-style: italic;">"+-"</span>:
                <span style="font-weight: bold;">return</span> dfs(i + 1, left + sign * right, 0, +1 <span style="font-weight: bold;">if</span> s[i] == <span style="font-style: italic;">"+"</span> <span style="font-weight: bold;">else</span> -1)

            <span style="font-weight: bold;">if</span> s[i] == <span style="font-style: italic;">"("</span>:
                <span style="font-weight: bold; font-style: italic;">ni</span>, <span style="font-weight: bold; font-style: italic;">right</span> = dfs(i + 1, 0, 0, +1)
                <span style="font-weight: bold;">return</span> dfs(ni, left + sign * right, 0, +1)

            <span style="font-weight: bold;">return</span> i + 1, left + sign * right

        <span style="font-weight: bold;">return</span> dfs(0, 0, 0, +1)
</pre>
</div>
</div>
</body>
</html>